
#ifndef	BUTTONS_H_
#define	BUTTONS_H_

#include <iostm8s103f3.h>
#include <intrinsics.h>

//номера выводов, к которым подключены кнопки

#define SET                6
#define NEXT               5
#define MENU_OK            4

//коды, которые будут записываться в буфер
#define KEY_NULL      0
#define KEY_MENU      1
#define KEY_SET       2
#define KEY_NEXT      3

/**************************************************************************
*   Function name : BUT_Init
*   Returns :       нет
*   Parameters :    нет
*   Purpose :       инициализация портов ввода/вывода
*                   вызывается обычно в начале main`a
****************************************************************************/
void BUT_Init(void);


/**************************************************************************
*   Function name : BUT_Debrief
*   Returns :       нет
*   Parameters :    нет
*   Purpose :       опрашивает кнопки. вызывается обычно из прерывания
*                   если кнопка нажата в течении 20 прерываний,
*                   ее номер записывается в буфер
****************************************************************************/
unsigned char BUT_Debrief(void);

/**************************************************************************
*   Function name : BUT_GetKey
*   Returns :       номер нажатой кнопки
*   Parameters :    нет
*   Purpose :       возвращает содержимое кнопочного буфера
*                   при этом буфер очищается
*                   вызывается обычно в main`e в цикле while
*
****************************************************************************/
unsigned char BUT_GetKey(void);


/**************************************************************************
*   Function name : BUT_Init
*   Returns :       нет
*   Parameters :    номер кнопки
*   Purpose :       записывает в кнопочный буфер значение
*                   требуется иногда для имитации нажатия кнопок
****************************************************************************/
void BUT_SetKey(unsigned char pressedKey);

#endif /* BUTTONS_H_ */
